
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("Документ.Заказ.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	Параметр = Новый Структура;
	Параметр.Вставить("СписокДок", ПараметрКоманды);
	ОткрытьФорму("Документ.ВыдачаЗаказов.Форма.ФормаДокумента", Параметр);
КонецПроцедуры
