
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр УспеваемостьСтудентов 
	Движения.УспеваемостьСтудентов.Записывать = Истина;
	Для Каждого ТекСтрокаСписокСтудентов Из СписокСтудентов Цикл
		Движение = Движения.УспеваемостьСтудентов.Добавить();
		Движение.Период = Дата;
		Движение.Студент = ТекСтрокаСписокСтудентов.Студент;
		Движение.Дисциплина = Дисциплина;
		Движение.Оценка = ТекСтрокаСписокСтудентов.Оценка;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
